code/phone/phones.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/8.5">

   <soapenv:Header/>

   <soapenv:Body>

      <ns:listPhone sequence="?">

         <searchCriteria>

               <name>%</name>

          </searchCriteria>

          <returnedTags>

               <name/>

               <model/>

               <callingSearchSpaceName/>

          </returnedTags>

      </ns:listPhone>

   </soapenv:Body>

</soapenv:Envelope>
